2013/brp 2013-02-07/test/trunk/KUC091/ART/request_template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.bprbzk.nl/BRP/0100" xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:OVL_RegistreerOverlijden_B>
         <ns:stuurgegevens>
            <stuf:berichtcode>Di02</stuf:berichtcode>
            <stuf:zender>
               <!--Optional:-->
               <stuf:organisatie>${DataSource Values#organisatie_zsO0}</stuf:organisatie>
               <stuf:applicatie>${DataSource Values#applicatie_zsO0}</stuf:applicatie>
            </stuf:zender>
            <stuf:referentienummer>${DataSource Values#referentienummer_sOO0}</stuf:referentienummer>
            <stuf:functie>${DataSource Values#functie_sOO0}</stuf:functie>
         </ns:stuurgegevens>
         <ns:parameters ns:communicatieID="comid.parameters_pOO0">
            <ns:verwerkingswijze stuf:noValue="waardeOnbekend">${DataSource Values#verwerkingswijze_pOO0}</ns:verwerkingswijze>
         </ns:parameters>
         <!--You have a CHOICE of the next 2 items at this level-->
         <ns:registratieOverlijdenNederland stuf:entiteittype="AdministratieveHandeling" ns:communicatieID="comid.regOverlijdenNederland_rOO0">
            <ns:partijCode stuf:noValue="waardeOnbekend">${DataSource Values#partijCode_rOO0}</ns:partijCode>
            <ns:tijdstipOntlening stuf:noValue="waardeOnbekend" stuf:exact="true">${DataSource Values#tijdstipOntlening_rOO0}</ns:tijdstipOntlening>
            <!--Optional:-->
            <ns:toelichtingOntlening stuf:noValue="nietGeautoriseerd">${DataSource Values#toelichtingOntlening_rOO0}</ns:toelichtingOntlening>
            <!--Optional:-->
            <ns:gedeblokkeerdeMeldingen>
               <!--1 or more repetitions:-->
               <ns:gedeblokkeerdeMelding stuf:entiteittype="GedeblokkeerdeMelding" ns:referentieID="${DataSource Values#|gedeblokkeerdeMelding0|}" ns:communicatieID="comid.gedeblokkeerdeMelding_ggr0">
                  <ns:regelCode stuf:noValue="nietGeautoriseerd">${DataSource Values#regelCode_ggr0}</ns:regelCode>
                  <!--Optional:-->
                  <ns:attribuutNaam stuf:noValue="geenWaarde">${DataSource Values#attribuutNaam_ggr0}</ns:attribuutNaam>
               </ns:gedeblokkeerdeMelding>
            </ns:gedeblokkeerdeMeldingen>
            <!--Optional:-->
            <ns:bijgehoudenDocumenten>
               <!--1 or more repetitions:-->
               <ns:document stuf:entiteittype="Document" ns:communicatieID="${DataSource Values#|Document_ddr0|}">
                  <ns:soortNaam stuf:noValue="nietOndersteund">${DataSource Values#soortNaam_ddr0}</ns:soortNaam>
                  <ns:identificatie stuf:noValue="geenWaarde">${DataSource Values#identificatie_ddr0}</ns:identificatie>
                  <!--Optional:-->
                  <ns:aktenummer stuf:noValue="nietOndersteund">${DataSource Values#aktenummer_ddr0}</ns:aktenummer>
                  <ns:partijCode stuf:noValue="nietGeautoriseerd">${DataSource Values#partijCode_ddr0}</ns:partijCode>
               </ns:document>
               <ns:document stuf:entiteittype="Document" ns:communicatieID="${DataSource Values#|Document_ddr1|}">
                  <ns:soortNaam stuf:noValue="nietOndersteund">${DataSource Values#soortNaam_ddr1}</ns:soortNaam>
                  <ns:identificatie stuf:noValue="geenWaarde">${DataSource Values#identificatie_ddr1}</ns:identificatie>
                  <!--Optional:-->
                  <ns:aktenummer stuf:noValue="nietOndersteund">${DataSource Values#aktenummer_ddr1}</ns:aktenummer>
                  <ns:partijCode stuf:noValue="nietGeautoriseerd">${DataSource Values#partijCode_ddr1}</ns:partijCode>
               </ns:document>
            </ns:bijgehoudenDocumenten>
            <ns:acties>
               <ns:registratieOverlijden stuf:entiteittype="Actie" ns:communicatieID="comid.registratieOverlijden_rar0">
                  <ns:datumAanvangGeldigheid stuf:noValue="waardeOnbekend" stuf:exact="true">${DataSource Values#datumAanvangGeldigheid_rar0}</ns:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
					<ns:document 	ns:communicatieID="comid.brondocument_bbr0"
									ns:referentieID="${DataSource Values#document_bbr0}"
									stuf:entiteittype="Document">${DataSource Values#document_bbr00}</ns:document>
					<ns:document 	ns:communicatieID="comid.brondocument_bbr1"
									ns:referentieID="${DataSource Values#document_bbr1}"
									stuf:entiteittype="Document">${DataSource Values#document_bbr01}</ns:document>
					 </ns:bronnen>
                  <ns:persoon stuf:entiteittype="Persoon" ns:technischeSleutel="${DataSource Values#|bsn_opr0|}" ns:communicatieID="comid.persoon_opr0">
                     <ns:overlijden ns:communicatieID="comid.overlijden_opr0">
                        <ns:datum stuf:noValue="waardeOnbekend" stuf:exact="true">${DataSource Values#datum_opr0}</ns:datum>
                        <!--Optional:-->
                        <ns:gemeenteCode stuf:noValue="nietGeautoriseerd">${DataSource Values#gemeenteCode_opr0}</ns:gemeenteCode>
                        <!--Optional:-->
                        <ns:woonplaatsCode stuf:noValue="geenWaarde">${DataSource Values#woonplaatsCode_opr0}</ns:woonplaatsCode>
                     </ns:overlijden>
                  </ns:persoon>
               </ns:registratieOverlijden>
            </ns:acties>
         </ns:registratieOverlijdenNederland>
         <ns:registratieOverlijdenBuitenland stuf:entiteittype="AdministratieveHandeling" ns:communicatieID="comid.regOverlijdenBuitenland_rOO1">
            <ns:partijCode stuf:noValue="waardeOnbekend">${DataSource Values#partijCode_rOO1}</ns:partijCode>
            <ns:tijdstipOntlening stuf:noValue="waardeOnbekend" stuf:exact="true">${DataSource Values#tijdstipOntlening_rOO1}</ns:tijdstipOntlening>
            <!--Optional:-->
            <ns:toelichtingOntlening stuf:noValue="nietGeautoriseerd">${DataSource Values#toelichtingOntlening_rOO1}</ns:toelichtingOntlening>
            <!--Optional:-->
            <ns:gedeblokkeerdeMeldingen>
               <!--1 or more repetitions:-->
               <ns:gedeblokkeerdeMelding stuf:entiteittype="GedeblokkeerdeMelding" ns:referentieID="${DataSource Values#|gedeblokkeerdeMelding1|}" ns:communicatieID="comid.gedeblokkeerdeMelding_ggr0">
                  <ns:regelCode stuf:noValue="nietGeautoriseerd">${DataSource Values#regelCode_ggr1}</ns:regelCode>
                  <!--Optional:-->
                  <ns:attribuutNaam stuf:noValue="geenWaarde">${DataSource Values#attribuutNaam_ggr1}</ns:attribuutNaam>
               </ns:gedeblokkeerdeMelding>
            </ns:gedeblokkeerdeMeldingen>
            <!--Optional:-->
            <ns:bijgehoudenDocumenten>
               <!--1 or more repetitions:-->
               <ns:document stuf:entiteittype="Document" ns:communicatieID="${DataSource Values#|Document_ddr3|}">
                  <ns:soortNaam stuf:noValue="nietOndersteund">${DataSource Values#soortNaam_ddr3}</ns:soortNaam>
                  <ns:identificatie stuf:noValue="geenWaarde">${DataSource Values#identificatie_ddr3}</ns:identificatie>
                  <!--Optional:-->
                  <ns:aktenummer stuf:noValue="nietOndersteund">${DataSource Values#aktenummer_ddr3}</ns:aktenummer>
                  <ns:partijCode stuf:noValue="nietGeautoriseerd">${DataSource Values#partijCode_ddr3}</ns:partijCode>
               </ns:document>
            </ns:bijgehoudenDocumenten>
            <ns:acties>
               <ns:registratieOverlijden stuf:entiteittype="Actie" ns:communicatieID="comid.registratieOverlijden_rar1">
                  <ns:datumAanvangGeldigheid stuf:noValue="waardeOnbekend" stuf:exact="true">${DataSource Values#datumAanvangGeldigheid_rar1}</ns:datumAanvangGeldigheid>
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
					<ns:document 	ns:communicatieID="comid.brondocument_bbr2"
									ns:referentieID="${DataSource Values#document_bbr2}"
									stuf:entiteittype="Document">${DataSource Values#document_bbr12}</ns:document>
					<ns:document 	ns:communicatieID="comid.brondocument_bbr3"
									ns:referentieID="${DataSource Values#document_bbr3}"
									stuf:entiteittype="Document">${DataSource Values#document_bbr13}</ns:document>
                  </ns:bronnen>
                  <ns:persoon stuf:entiteittype="Persoon" ns:technischeSleutel="${DataSource Values#|bsn_opr1|}" ns:communicatieID="comid.persoon_opr1">
                     <ns:overlijden ns:communicatieID="comid.overlijden_opr1">
                        <ns:datum stuf:noValue="waardeOnbekend" stuf:exact="true">${DataSource Values#datum_opr1}</ns:datum>
                        <!--Optional:-->
                        <ns:buitenlandsePlaats stuf:noValue="waardeOnbekend">${DataSource Values#buitenlandsePlaats_opr1}</ns:buitenlandsePlaats>
                        <!--Optional:-->
                        <ns:buitenlandseRegio stuf:noValue="waardeOnbekend">${DataSource Values#buitenlandseRegio_opr1}</ns:buitenlandseRegio>
                        <!--Optional:-->
                        <ns:omschrijvingLocatie stuf:noValue="waardeOnbekend">${DataSource Values#omschrijvingLocatie_opr1}</ns:omschrijvingLocatie>
                        <ns:landCode stuf:noValue="waardeOnbekend">${DataSource Values#landCode_opr1}</ns:landCode>
                     </ns:overlijden>
                  </ns:persoon>
               </ns:registratieOverlijden>
            </ns:acties>
         </ns:registratieOverlijdenBuitenland>
      </ns:OVL_RegistreerOverlijden_B>
   </soapenv:Body>
</soapenv:Envelope>